let handler = async (m, { conn }) => {
    let message = {
        viewOnceMessage: {
            message: {
                interactiveMessage: {
                    header: {
                        text: "قــائــمــة الاكــ🔖ــواد"
                    },
                    body: {
                        text: "⧠━───━⧈⇓《🌸》⇓⧈━───━⧠\n《🌸ان الله وملائـكته يصلون على النبي يا ايها الذين امنو صلو عليه وسلمو تسليما🌸》\n⧠━──━⧈⇓《🌸》⇓⧈━──━⧠\n⏎┇(😜)┇《اهلا بك ف بوت تيربو》\n⏎┇(😜)┇《لعرض القسام البوت أضغط ع القائمة》\n⏎┇🌸⃝•┇《اسم البوته┇𝑻𝑬𝑹𝑩𝑶〔⚡️〕𝑩𝑶𝑻》\n⏎┇😜┇《الاصدار V3.0》\n⧠━──━⧈⇓《😜》⇓⧈━──━⧠\n⧉┇⪻⫷𝑻𝑬𝑹𝑩𝑶〔⚡️〕𝑩𝑶𝑻⫸≫\n⧠━──━⧈⇓《😜》⇓⧈━──━⧠"
                    },
                    nativeFlowMessage: {
                        buttons: [
                            {
                                name: "single_select",
                                buttonParamsJson: JSON.stringify({
                                    title: "الـــاكــــواد",
                                    sections: [
                                        {
                                            title: "List",
                                            highlight_label: "ON",
                                            rows: [
                                                {
                                                    header: "قلب الاسبام اباحي مشدد",
                                                    title: "حقوق 𝑻𝑬𝑹𝑩𝑶",
                                                    description: "हैलो, WhatsApp समर्थन टीम। मेरी संख्या को एक हैकर द्वारा अवरुद्ध किया गया था जिन्होंने अपनी नीति और उल्लंघन की गोपनीयता का विरोध करने वाली चीजों को भेजा था। मैंने इसका उल्लंघन नहीं किया और मैं गलती नहीं थी। इस मामले में, उन्होंने क्या संशोधित संस्करण कहा जाता है, और हम एक बड़े और प्रसिद्ध व्यापारी हैं। भले ही मेरे खाते पर प्रतिबंध नहीं उठाया गया था, मैं आपके उपचार से संतुष्ट नहीं होगा। जब मेरी संख्या अवरुद्ध हो गई थी, तब मैं अपने परिवार और दोस्तों से बात कर रहा था, लेकिन मैं इसे व्हाट्सएप का उपयोग करके बहुत अच्छी तरह जानते थे। यह कई साल रहा है और मेरा खाता पहले कभी अवरुद्ध नहीं हुआ है, और अब व्हाट्सएप एजेंटों द्वारा त्रुटि हुई है। हालांकि, इन अपराधियों ने कष्टप्रद संदेश लिखे, और इस अपराधी ने संशोधित व्हाट्सएप का इस्तेमाल किया, और ज़ार ने विपरीत संदेशों को सक्रिय किया और एक कष्टप्रद संदेश भेजा, और इस व्यक्ति ने इस कष्टप्रद संदेश की सूचना दी, और मेरी संख्या को किसी कारण से अवरुद्ध नहीं किया गया, और यह त्रुटि आपकी खराब सेवा से आई। इस समस्या का समाधान तुरंत पाया जाना चाहिए। मुझे आशा है कि मेरे खाते पर प्रतिबंध उठाया जाएगा और मेरी संख्या है+20",
                                                    id: "te"
                                                },
                                                {
                                                    header: "كـــود فــك  اســبــام",
                                                    title: "استرجاع الحساب",
                                                    description: "Olá, Suporte do WhatsApp, submeto a você esta solicitação de revisão. Minha conta foi bloqueada devido a um erro de sua parte, por favor, tome sua decisão o mais rápido possível ao solicitar uma revisão de minha conta (+48732105605) e obrigado. , seu irmão Lúcifer.",
                                                    id: "te"
                                                },
                                                {
                                                    header: "رفـــع حـــظـــر",
                                                    title: "طلب رفع الحظر",
                                                    description: "*الانواع تقريبا*\n🕷️*الموضوع:\nالموضوع:שלום צוות\nWhatsApp, המספר שלי חסום בבקשה לפתור את הבעיה שלי ולהגיב על ידי הסרת האיסור בהקדם\nהאפשרי\n\n\n\n¶الكود👇🏻\n\nשלום צוות התמיכה של\n WhatsApp, אני אזרח ישראלי והחשבון שלי נחסם על ידי צעיר פלסטיני שמשתמש בגרסאות מתוקנות של WhatsApp. הוא דיווח עליי ונחסמתי בטעות בבקשה המספר שלי מקושר לעבודה שלי וחסם את העבודה שלי בבקשה המשך את האיסור שלי\n+2490110931421\nالكود لما الشركة ترد عليك ترد 👇🏻\nאני כועס על השימוש בוואטסאפ כי לא הפעלת את החסימה ואתה אומר שאני צריך ללכת לוואטסאפ ולהגיש את הבקשה שלי, אבל עדיין לא ביטלת אותי, וזה לא מותר לך לדכא אותי בעניין הזה כתבת לך גם ב-Gmail ולא הסרת את החסימה על המספר שלי בבקשה, צוות התמיכה של WhatsApp, האיץ את ביטול החסימה של המספר שלי אני זה מה שנקרא לוחמה אלקטרונית הפלסטינים חוסמים את המספרים שלנו בוואטסאפ, ואתם עוזרים להם בבקשה, צוות התמיכה של WhatsApp, תבטלו את האיסור על המספר שלי+2490110931421",
                                                    id: "te"
                                                },
                                              {
                            header: "بــــانـــد فـــنـــش",
                              title: "بــــانـــد فـــنـــش",
                                                    description: "دا بـانـد الـفـنـش يـقـلـبـي شـغـال نـار طـرش مـن ابـلاغ واحـد\n\n🔽🔽🔽🔽🔽🔽🔽🔽🔽🔽🔽🔽\n\nOlá, minha querida, meu nome é Kimo Afkhai Adraei. Sou um terrorista israelense. Sequestro crianças inocentes e estupro mulheres nas ruas de Gaza. Eu mato adultos e crianças, torturo-os e banho-me em seu sangue. haxixe narcótico dos Estados Unidos da América para Israel Agora você pode comprar haxixe e drogas conosco através do WhatsApp, a empresa terrorista ⛔️⛔️❌ Contate-nos agora pelo nosso número. 👇👇 https://api.whatsapp.com/send?phone=+20",
                                                    id: "te"
                          },
                                              {
                                                header: "رفع حظر انتهاك مشدد",
                              title: "رفع حظر",
                                                    description: "Mon compte a été banni par erreur et jaimerais reprendre le bannissement au plus vite. Le compte d un employé a été bloqué chez 𝐔𝐍.\n ¶¶الكود¶¶\nBonjour android@support.whatsapp.com,\nmon compte a été banni en ligne. Je n ai pas violé les conditions d utilisation de android@support.whatsapp.com. Je suis l un des plus anciens utilisateurs de WhatsApp. J utilise WhatsApp depuis 2009. Je n ai pas violé mes conditions d emploi. Je réside en Allemagne lorsque j ai entré mon numéro. Soudain, j ai été bloqué et on m a dit que j avais violé mes conditions d emploi. Je vis en Allemagne et je travaille pour l Union européenne et l UNICEF en tant qu employé. et mon numéro est lié à mon travail. Je vais perdre mon emploi et perdre de l argent estimé à 7 000 dollars américains. Veuillez débloquer mon numéro et accélérer le processus. moi dans mon travail et je vais perdre mon emploi à l UNICEF. J ai la confiance des USA et j écris à mon manager avec ce numéro et j utilise mon numéro (+ Il a été bloqué dès que possible). que possible et reprendre mon travail avec l ONU. Mon numéro est abonné à des organisations de défense des droits de l homme. Il existe un groupe de vandales qui rapportent de faux rapports qui n ont aucune vérité au point qu ils ont fait perdre à un employé de l ONU son numéro lié à son travail. Merci à android@support.whatsapp.com de reprendre l interdiction de mon numéro (+). Un merci spécial à android@support.whatsapp.com/n équipe WhatsApp s excuse pour la gêne occasionnée.",
                                                    id: "te"
                                              },
                                              {
header: "تبنيد باند لي الارقام الفنش",
                              title: "بلع اخصامك",
                                                    description: "Здравствуйте, уважаемый пользователь приложения WhatsApp, меня зовут Мухаммед, и я недавно приобрел компанию WhatsApp за 200 миллиардов долларов. Я создал и добавил множество функций. Это позволяет террористам создавать группы для убийств и пыток, и позволяет торговцам наркотиками продавать и создавать каналы для продвижения продажи таблеток с наркотиками. Теперь вы можете перевести 100 долларов США на мой счет через криптовалюту для нас. Приложение WhatsApp больше не является бесплатным. Отправьте нам сообщение, чтобы узнать больше, по следующему номеру.👇👇\nhttps://api.whatsapp.com/send?phone=",
                                                    id: "te"  
                                              },
                                              {
header: "حل مشكلة الحظر ",
                              title: "𝑻𝑬𝑹𝑩𝑶〔⚡️〕𝑩𝑶𝑻",
                                                    description: "nमेरा WhatsApp अकाउंट नहीं खुल रहा है\nالكود""""\n\nMon compte WhatsApp ne s ouvre pas, il dira que ce compte n est pas ouvert, vous avez besoin d un compte officiel, alors réparez le compte WhatsApp et je suis confronté à ce problème",
                                                    id: "te"   
                                              }
                                            ]
                                        }
                                    ]
                                })
                            }
                        ]
                    }
                }
            }
        }
    };

    // إرسال الرسالة
    await conn.relayMessage(m.chat, message, {});
};

handler.command = /^(codes|اكواد)$/i;

export default handler;
